{
  "en": {
    "navabout": "About",
    "navskills": "Skills",
    "navprojects": "Projects",
    "navcontact": "Contact",
    "langen": "English",
    "langar": "Arabic",
    "langru": "Russian",
    "languk": "Ukrainian",
    "langenglish": "English",
    "langenglishlevel": "Intermediate",
    "langarabic": "Arabic",
    "langarabiclevel": "Native",
    "langrussian": "Russian",
    "langrussianlevel": "Beginner",
    "langukrainian": "Ukrainian",
    "langukrainianlevel": "Beginner",
    "herotitle": "Morkos Abanoub",
    "herosubtitle": "Junior React Front-End Developer",
    "herocontact": "Contact Me",
    "herocv": "My Resume",
    "abouttitle": "About Me",
    "abouttext1": "I work as a front-end developer focused on building clean, modern, and responsive user interfaces using React and the latest web technologies. I enjoy turning ideas and designs into smooth, interactive experiences while writing maintainable and scalable code.",
    "abouttext2": "I learn new tools quickly and approach technical challenges with logical problem-solving. I perform well under pressure, manage my time effectively, and collaborate easily with teams. I value clarity, structured thinking, and continuous improvement.",
    "abouttext3": "My goal is to join a professional team where I can contribute to creating strong digital products with great user experience. I am committed to improving my skills, expanding my knowledge of the front-end ecosystem, and building interfaces that deliver real value to users.",
    "skillstitle": "Technical Skills",
    "skillsprogramming": "Programming Languages",
    "skillsjs.desc": "My main language for building dynamic and interactive user interfaces",
    "skillstsdesc": "A typed version of JavaScript that I'm currently learning to improve code maintainability",
    "skillshtmldesc": "Markup language I use to structure web pages",
    "skillscssdesc": "Styling language I use to design responsive and modern UI layouts",
    "projectstitle": "My Projects",
    "projectsproject1title": "Modern E-commerce UI",
    "projectsproject1desc": "A fully responsive e-commerce interface built with React, custom hooks, and API integration.",
    "projectsproject2title": "Task Manager UI",
    "projectsproject2desc": "A productivity front-end app built with React, handling tasks, filters, and smooth animations.",
    "projectsproject3title": "Personal Portfolio",
    "projectsproject3desc": "A modern portfolio showcasing my front-end skills using React, CSS, and animations.",
    "projectsview": "View Project",
    "projectscode": "View code",
    "contacttitle": "Get In Touch",
    "contactemailtitle": "Email",
    "contactemail": "morkos.abanoub@example.com",
    "contactemail.button": "Send Email",
    "contactphonetitle": "Phone",
    "contactphone": "+20 123 456 7890",
    "contactphonebutton": "Call Me",
    "contactcvtitle": "Download CV",
    "contactcvtext": "my full resume and experience",
    "contactcvbutton": "Download CV",
    "githubtext": "My projects on GitHub",
    "contactformtitle": "Send Me a Message",
    "contactformname": "Your Name",
    "contactformemail": "Email Address",
    "contactformmessage": "Message",
    "contactformbutton": "Send Message",
    "footercopyright": "© 2023 Morkos Abanoub - React Front-End Developer",
    "isloading": "Loading...",
    "skillhtml5": "HTML5",
    "skillcss": "CSS",
    "skillsass": "SASS",
    "skilljavascript": "JavaScript",
    "skilltypescript": "TypeScript",
    "skillreact": "React",
    "skillnode": "Node.js",
    "skillexpress": "Express",
    "skillrestapi": "REST APIs",
    "skillmongodb": "MongoDB",
    "skillmysql": "MySQL",
    "skillbootstrap": "Bootstrap",
    "skilltailwind": "Tailwind CSS",
    "skillgit": "Git",
    "skilldocker": "Docker",
    "project1": "Restaurant Website",
    "project1disc": "A beautifully crafted restaurant website designed to deliver a smooth and mouth-watering user experience. Visitors can explore a rich menu, discover signature dishes, learn about the restaurant’s story, and easily find location and contact details — all wrapped in a clean, modern, and responsive design that works perfectly on phones and desktops.",
    "project2": "E-commerce website",
    "project2disc": "A full e-commerce web application built with React that includes product browsing, cart management, and a smooth checkout flow. It also features a complete admin dashboard for managing products, users, and overall store content. The site is available in four languages: English, Arabic, Ukrainian..",
    "project3": "Portfolio / CV Website",
    "project3disc": "A modern, responsive portfolio website template for showcasing personal information, skills, and projects. Designed as a general-purpose CV/portfolio for developers, designers, and freelancers, with clean sections, smooth navigation, and easy-to-edit demo content. Available in English, Arabic, Ukrainian, and Russian.",
    "project4": "HTML & CSS Skills Showcase",
    "project4disc": "A front-end demonstration project created specifically to showcase core HTML and CSS skills. The project focuses on clean structure, semantic HTML, responsive layouts, and modern CSS techniques such as Flexbox and Grid. It was built as a practical skills test rather than a production website, using demo content to highlight layout accuracy, styling consistency, and attention to detail., responsive layouts, and modern CSS techniques like Flexbox and Grid.",
    "successful_send": "✅ Message sent successfully!",
    "send_error": "❌ An error occurred while sending, please try again."
  }
}
